OpenFOAM-v2412/tutorials/lagrangian/kinematicParcelFoam/drippingChair/system/finite-area/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                 Euler;
}

gradSchemes
{
    default                 Gauss linear;
}

divSchemes
{
    default                  none;
    div(phif_film,hf_film)   Gauss upwind;
    div(phi2s_film,Uf_film)  Gauss upwind;
    div(faceAreaNormals)     Gauss linear;
}

laplacianSchemes
{
    default                 none;
    laplacian(hf_film)      Gauss linear corrected;
}

interpolationSchemes
{
    default                 linear;
}

lnGradSchemes
{
    default                 corrected;
}

fluxRequired
{
    hf_film                 true;
}


// ************************************************************************* //
